export const addresses = [
    {
        id: "moscow",
        address: "109542, Москва, пр-кт Рязанский, д. 10, стр. 18, помещ. 15/6",
    },
    {
        id: "donetsk",
        address: "пл. Коммунаров, 1, Донецк, Донецкая область, 83000",
    },
    {
        id: "kazan",
        address: "ул. Васильченко, 9, Казань, Респ. Татарстан, 420006",
    },
    {
        id: "nizhnynovgorod",
        address: "Московское ш., 52, Нижний Новгород, Нижегородская обл., 603079",
    },
    {
        id: "ryazan",
        address: "Московское ш., 147А, Рязань, Рязанская обл., 390020",
    },
    {
        id: "saratov",
        address: "Дегтярная пл., 1, офис 19.202, Саратов, Саратовская обл., 410004",
    },
    {
        id: "tver",
        address: "б-р Цанова, 6, Тверь, Тверская обл., 170033",
    },
    {
        id: "tula",
        address: "Новомосковское ш., 54, Тула, Тульская обл., 300045",
    },
    {
        id: "ufa",
        address: "пр-т. Дружбы Народов, 19, Уфа, Респ. Башкортостан, 450112",
    },
    {
        id: "voronezh",
        address: "ул. Димитрова, 154, Воронеж, Воронежская обл., 394090",
    },
    {
        id: "yaroslavl",
        address: "Осташинская ул., 10, Ярославль, Ярославская обл., 150044",
    },
];
