export const Gost_380_80 = [
  [
    "Ст0",
    "-",
    "Марка Ст0 - сталь сваривается без ограничений.",
    "Второстепенные элементы металлоконструкций. Неответственные детали: обшивки, кожухи, перила, шайбы, настилы, арматура.",
  ],
  [
    "Ст2кп, Ст2пс, Ст2сп",
    "Ст2пс, Ст2сп",
    "Марка Ст2кп, Ст2пс, Ст2сп - сталь сваривается без ограничений, рекомедуется подогрев и последующая термообработка для толщины более 36 мм.",
    "Неответственные детали, требующие повышенной пластичности. Малонагруженные элементы металлоконструкций, используемые при положительных температурах и постоянных нагрузках.",
  ],
  [
    "Ст3кп",
    "Ст3пс",
    "Марка Ст3кп - сталь сваривается без ограничений, для толщины более 36 мм рекомендуется подогрев, далее термообработка.",
    "Применяется для второстепенных малонагруженных элементов металлоконструкций, работающих при температуре от -10°С до 400°С.",
  ],
  [
    "Ст3пс, Ст3сп",
    "Ст3сп, Ст3пс",
    "Марка Ст3пс/сп - сталь сваривается без ограничений, для толщины более 36 мм рекомендуется подогрев и дальнейшая термообработка.",
    "Несущие, ненесущие элементы сварных и несварных конструкций, работающих при положительных температурах. Фасонный и листовой прокат толщиной до 10 мм, применяемых при температуре от -40°С до 425°С для марки стали Ст3пс толщиной проката до 25 мм. При толщине проката свыше 25 мм используется марка Ст3пс для несущих элементов металлоконструкций от -40°С до 425°С при условии поставки с гарантией свариваемости.",
  ],
  [
    "Ст3Гпс",
    "Ст3пс, Ст18Гпс",
    "Марка Ст3Гпс - сталь сваривается без ограничений, для толщины проката более 36 мм рекомендуется подогрев, далее термообработка.",
    "Фасонный и листовой прокат толщиной до 36 мм для несущих элементов металлоконструкций, применяемых при переменных нагрузках от -40°С до 425°С.",
  ],
  [
    "Ст4кп",
    "-",
    "Марка Ст4кп - сталь сваривается ограниченно.",
    "Сварные, клепаные, болтовые конструкции повышенной прочности. Изготовление из марки Ст4кп сортового и листового проката.",
  ],
  [
    "Ст4пс",
    "Ст4пс",
    "Марка Ст4пс - сталь сваривается ограниченно.",
    "Сварные, клепаные, болтовые конструкции повышенной прочности, изготовление валов, втулок, осей, работающих при малых нагрузках.",
  ],
  [
    "Ст5пс, Ст5сп",
    "Ст6сп, Ст4сп",
    "Марки Ст5пс, Ст5сп - сталь сваривается ограниченно, рекомендуется подогрев, далее термообработка.",
    "Применяется для изготовления клепаных изделий, для изготовления болтов, гаек, ручек, ходовых валиков, втулок, клиньев, рычагов, упоров, пальцев, стержней, звездочек, фланцев, работающих при тепературном режиме от 0°С до 425°С.",
  ],
  [
    "Ст6пс",
    "-",
    "Марка Ст6пс - сталь сваривается с ограничениями, рекомендуем подогрев и дальнейшую термообработку.",
    "Используется для изготовления деталей повышенной прочности, таких как оси, валы, поршни.",
  ],
  [
    "Ст6сп",
    "Ст5сп",
    "Марка Ст6сп - сталь сваривается с ограничениями. Рекомендуется подогрев, далее термообработка.",
    "Используется для изготовления деталей конструкций повышенной прочности: осей, валов, пальцев, для изготовления стержней арматуры переодического профиля.",
  ],
];

export const Gost_1050_88 = [
  [
    "Ст08",
    "Ст10",
    "Марка Ст08 - сталь сваривается без ограничений.",
    "Используется для изготовления деталей высокой пластичности, шайбы, патрубки, прокладки, работающие при температуре от -40°С до 450°С.",
  ],
  [
    "Ст08кп, Ст08пс",
    "Ст08",
    "Марка Ст08кп, 08пс - сталь сваривается без ограничений.",
    "Использование для изготовления шайб, вилок, труб, втулок, проушин, тяг.",
  ],
  [
    "Ст10",
    "Ст08, Ст15, Ст08кп	",
    "Марка стали Ст10 - сталь сваривается без ограничений, за исключением конструкций после химико-термической обработки.",
    "Изготовления деталей, работающих при температурном режиме от -40°С до 450°С, которые имеют высокую пластичность.",
  ],
  [
    "Ст10кп, Ст10пс",
    "Ст08кп, Ст15кп, Ст10",
    "Марка Ст10кп, 10пс - сталь сваривается без ограничений, за исключением металлоконструкций после химико-термической обработки.",
    "Производство деталей работающих при температуре до 450°С, имеющих высокую пластичность, втулки, ушки, шайбы, винты, а также детали с высокой поверхностной твердостью, износостойкостью, имеющие высокую прочность сердцевины.",
  ],
  [
    "Ст15",
    "Ст10, Ст20",
    "Марка Ст15 - сталь сваривается без ограничений, за исключением конструкций после химико-термической обработки.",
    "Изготовление болтов, винтов, крюков, детали имеющие высокую пластичность, работающих при температуре от -40°С до 450°С.",
  ],
  [
    "Ст15кп, Ст15пс",
    "Ст10кп, Ст20кп",
    "Марки Ст15кп, 15пс - сталь сваривается без ограничений.",
    "Изготовление элементов трубных соединений, штуцера, вилки, крепежные детали, рычаги, оси, детали работающие при температуре от -40°С до 450°С.",
  ],
  [
    "Ст18кп",
    "-",
    "Марка стали Ст18кп - сталь сваривается без ограничений.",
    "Производится изготовление из марки 18 различных строительных металлоконструкций.    ",
  ],
  [
    "Ст20",
    "Ст15",
    "Марка Ст20 - сталь сваривается без ограничений, за исключением металлоконструкций после химико-термической обработки.",
    "Изготовление деталей: крюки кранов, муфты, вкладыши подшипников, шестерни, червяки, детали работающие при температуре от -40°С до 450°С под давлением.",
  ],
  [
    "Ст20кп, Ст20пс",
    "Ст15кп",
    "Марки Ст20кп, Ст20пс - сталь сваривается без ограничений, за исключением конструкций после химико-термической обработки.",
    "Изготовление деталей: патрубки, штуцера, вилки, болты, фланцы, различные корпуса, оси, пальцы, звездочки, детали из кипящей стали, работающие в температурном режиме от -20°С до 425°С.",
  ],
  [
    "Ст25",
    "Ст20, Ст30",
    "Марка Ст25 - сталь сваривается без ограничений, за исключением металлоконструкций после химико-термической обработки.",
    "Изготовление деталей: оси, валы, муфты соединительные, собачки, рычаги, вилки, шайбы, валики, болты, фланцы, тройники, неответственные детали. После термообработки винты, втулки.",
  ],
  [
    "Ст30",
    "Ст25, Ст35",
    "Марка Ст30 - сталь сваривается без ограничений, рекомедуется подогрев, далее термообработка.",
    "Изготовление деталей: тяги, серьги, траверсы, рычаги, валы, звездочки, шпиндели, цилиндры, муфты, детали невысокой прочности.",
  ],
  [
    "Ст35",
    "Ст30, Ст40",
    "Марка Ст35 - сталь сваривается без ограничений, рекомедуется подогрев, далее термообработка.",
    "Изготовление деталей невысокой прочности, работающие при невысоком напряжении: оси, цилиндры, валы, втулки, шпиндели, звездочки, тяги, ободы, траверсы, валы, бандажи, диски.",
  ],
  [
    "Ст40",
    "Ст35, Ст45, Ст40Г",
    "Марка Ст40 - сталь сваривается ограниченно, рекомедуется подогрев, далее термообработка.",
    "После улучшения, изготовление деталей: валы, шатуны, венцы, маховики, зубчатые колеса, болты, оси.",
  ],
  [
    "Ст45",
    "Ст40Х, Ст50, Ст50Г2",
    "Марка Ст45 - сталь сваривается ограниченно, рекомедуется подогрев, далее термообработка.",
    "Изготовление деталей повышенной прочности: вал-шестерни, валы, шестерни, шпиндели, бандажи, цилиндры, кулачки.",
  ],
  [
    "Ст50",
    "Ст45, Ст50Г, Ст50Г2, Ст55",
    "Марка Ст50 - сталь сваривается трудно, рекомедуется подогрев, далее термообработка.",
    "Изготовление деталей после нормализации и закалки с отпуском: зубчатые колеса, валки, штоки, валы, оси, бандажи, пружины, рессоры, пальцы звеньев.",
  ],
  [
    "Ст55",
    "Ст50, Ст60, Ст50Г",
    "Марка Ст55 - сталь не сваривается, не применяется для сварных металлоконструкций.",
    "Изготовление деталей работающих на трение: гусеницы, муфты сцепления коробок передач, корпуса форсунок.",
  ],
  [
    "Ст58, Ст55пп",
    "Ст30ХГТ, Ст20ХГНТР, Ст20ХН2М, Ст12ХН3А, Ст18ХГТ",
    "Марка Ст58 - сталь не сваривается, не применяется для сварных металлоконструкций.",
    "Изготовление деталей с тонкими сечениями упрочняемых элементов, деталей, к которым предъявляются требования высокой износостойкости при вязкой сердцевине, детали работающие на высоких скоростях и средних давлениях.",
  ],
  [
    "Ст60",
    "Ст55, Ст65Г",
    "Марка Ст60 - сталь не сваривается, не применяется для сварных металлоконструкций.",
    "Изготовление деталей высокой прочности и износостойкости: колесные пары для вагонов ЖД, валки, шпиндели, бандажи, диски сцепления, пружинные амортизаторы, замочные шайбы, регулировочные шайбы и прокладки.",
  ],
];

export const Gost_9045_80 = [
  [
    "Ст08Ю",
    "-",
    "Марка Ст08Ю - сталь сваривается без ограничений.",
    "Изготовление деталей холодной штамповкой сложной и особо сложной вытяжкой.",
  ],
];

export const Gost_5520_79 = [
  [
    "Ст16К",
    "-",
    "Марка 16К - сталь сваривается без ограничений.",
    "Изготовление деталей котлов, сосудов, работающих под давлением при низких и повышенных температурах.",
  ],
  [
    "Ст18К",
    "-",
    "Марка 18К - сталь сваривается без ограничений.",
    "Изготовление деталей котлов, сосудов, работающих под давлением при низких и повышенных температурах.",
  ],
  [
    "Ст20К",
    "-",
    "Марка 20К - сталь сваривается без ограничений.",
    "Изготовление сосудов и котлов: барабаны паровых котлов, полумуфты, корпуса аппаратов, работающих под давлением при температуре до 450°С.",
  ],
  [
    "Ст22К",
    "-",
    "Марка 22К - сталь сваривается с наличием ограничений, рекомендуется подогрев, далее термообработка.",
    "Изготовление деталей котлов работающие под давлением при температуре от -40°С до 450°С: фланцы, днища, барабаны паровых котлов, полумуфты, патрубки.",
  ],
];

export const Gost_1414_75 = [
  [
    "СтА20",
    "Ст12А",
    "Марка А20 - сталь не сваривается, не применяется для сварных конструкций.",
    "Изготовление мелких деталей различных машин, приборов, малонагруженных деталей сложной конфигурации, детали высокой точности, качества поверхности и износостойкости.",
  ],
  [
    "СтА30",
    "СтА40Г",
    "Марка А30 - сталь не сваривается, не применяется для сварных конструкций.",
    "Изготовление деталей работающих при высоких напряжениях и давлениях, имеющие качество поверхности: оси, валки, втулки, пальцы, шестерни, кольца, винты, болты, гайки, детали сложной формы.",
  ],
];

export const Gost_19281_89 = [
  [
    "Ст09Г2",
    "Ст09Г2С, Ст10Г2",
    "Марка Ст09Г2 - сталь сваривается без ограничений.",
    "Изготовление металлоконструкций и деталей: стойки ферм, обвязки вагонов ЖД, хлебтовые балки, двутавры, детали вагоностроения, экскаваторов, детали работающие при температуре от -40°С до 450°С.",
  ],
  [
    "Ст14Г2",
    "Ст15ХСГД",
    "Марка 14Г2 - сталь сваривается с наличием ограничений.",
    "Изготовление листовых металлоконструкций, работающих при температурном режиме до -70°С.",
  ],
  [
    "Ст12ГС",
    "Ст15ГС",
    "Марка 12ГС - сталь сваривается без ограничений.",
    "Изготовление деталей путем ковки, штамповки, вытяжки.",
  ],
  [
    "Ст16ГС",
    "Ст17ГС",
    "Марка 16ГС - сталь сваривается без ограничений.",
    "Изготовление деталей работающих под давлением от -70°С до 475°С: фланцы, корпуса.",
  ],
  [
    "Ст17ГС",
    "Ст16ГС",
    "Марка 17ГС - сталь сваривается без ограничений.",
    "Изготовление деталей работающих под давлением от -40°С до 475°С: фланцы, корпуса, днища.",
  ],
  [
    "Ст09Г2С",
    "Ст10Г2С, 09Г2",
    "Марка 09Г2С - сталь сваривается без ограничений.",
    "Изготовление металлоконструкций работающих под давлением при температуре от -70°С до 475°С.",
  ],
  [
    "Ст10Г2С1",
    "Ст10Г2С1Д",
    "Марка 10Г2С1 - сталь сваривается без ограничений.",
    "Изготовление деталей и металлоконструкций работающих при температуре от -70°С до 475°С под давлением: аппараты, сосуды, части паровых котлов.",
  ],
  [
    "Ст10Г2БД",
    "Ст10Г2Б",
    "Марка 10Г2БД - сталь сваривается без ограничений.",
    "Изготовление сварных металлоконструкций.",
  ],
  [
    "Ст15Г2СФД",
    "-",
    "Марка 15Г2СФД - сталь сваривается без ограничений.",
    "Изготовление сварных металлоконструкций.",
  ],
  [
    "Ст14Г2АФ",
    "-",
    "Марка 14Г2АФ - сталь сваривается без ограничений.",
    "Изготовление промышленных металлоконструкций, подкрановых ферм для мостовых кранов.",
  ],
  [
    "Ст16Г2АФ",
    "Ст14Г2АФ",
    "Марка 16Г2АФ - сталь сваривается без ограничений.",
    "Изготовление металлоконструкций, сварных ферм для машиностроения.",
  ],
  [
    "Ст18Г2Афпс",
    "Ст15Г2АФДпс, Ст16Г2АФ, Ст10ХСНД, Ст15ХСНД",
    "Марка 18Г2Афпс - сталь сваривается без ограничений.",
    "Производство листового проката для изготовления несущих элементов металлоконструкций, которые работают при температуре до -60°С.",
  ],
  [
    "Ст14ХГС",
    "Ст15ХСНД, Ст16ГС",
    "Марка 14ХГС - сталь сваривается без ограничений.",
    "Изготовление сварных металлоконструкций и деталей.",
  ],
  [
    "Ст15Г2АФДпс",
    "Ст16Г2АФ, Ст18Г2АФпс, Ст10ХСНД, Ст15ХСНД",
    "Марка 15Г2АФДпс - сталь сваривается без ограничений.",
    "Изготовление ответственных сварных металлоконструкций северного исполнения.",
  ],
  [
    "Ст10ХСНД",
    "Ст16Г2АФ",
    "Марка 10ХСНД - сталь сваривается без ограничений.",
    "Изготовление элементов сварных металлоконструкций повышенной прочности, коррозионной стойкости, работающих при температуре от -70°С до 450°С.",
  ],
  [
    "Ст10ХНДП",
    "-",
    "Марка 10ХНДП - сталь сваривается без ограничений.",
    "Изготовление сварных металлоконструкций для строительной и машиностроительной отрасли.",
  ],
  [
    "Ст15ХСНД",
    "Ст16Г2АФ, Ст14ХГС, Ст16ГС",
    "Марка 15ХСНД - сталь сваривается без ограничений.",
    "Изготовление элементов сварных металлоконструкций повышенной прочности, коррозионной стойкости, работающих при температуре от -70°С до 450°С.",
  ],
];

export const Gost_5781_82 = [
  [
    "Ст20ХГ2Ц",
    "-",
    "Марка 20ХГ2Ц - сталь сваривается без ограничений.",
    "Изготовление строительной арматуры периодического профиля класса А4 диаметром от 10 мм до 32 мм.",
  ],
  [
    "Ст35ГС, Ст25Г2С",
    "Ст5сп, Ст6, Ст5пс",
    "Марка 35ГС, 25Г2С - сталь сваривается без ограничений.",
    "Изготовление строительной арматуры периодического профиля класса А3 диаметром от 6 мм до 40 мм.",
  ],
];

export const Gost_4543_71 = [
  [
    "Ст15Х",
    "Ст20Х",
    "Марка 15Х - сталь сваривается без ограничений, ограничения на детали после химико-термической обработки.",
    "Изготовление деталей с высокой поверхностной твердостью, деталей работающих в условиях трения: втулки, пальцы, шестерни, валики, толкатели.",
  ],
  [
    "Ст20Х",
    "Ст15Х, Ст20ХН, Ст18ХГТ",
    "Марка 20Х - сталь сваривается без ограничений, ограничения на детали после химико-термической обработки.",
    "Изготовление деталей с высокой поверхностной твердостью, деталей работающих в условиях трения: втулки, шестерни, обоймы, гильзы, диски, плунжеры, рычаги.",
  ],
  [
    "Ст30Х",
    "Ст35Х",
    "Марка 30Х - сталь ограниченно свариваемая.",
    "Изготовление небольших деталей: оси, валики, рычаги, болты, гайки.",
  ],
  [
    "Ст35Х",
    "Ст40Х",
    "Марка 35Х - сталь ограниченно свариваемая.",
    "Изготовление улучшаемых деталей: оси, валы, шестерни, кольцевые рельсы.",
  ],
  [
    "Ст38ХА",
    "Ст40Х, Ст35Х",
    "Марка 38ХА - сталь трудносвариваемая.",
    "Изготовление ответственных деталей: червяки, зубчатые колеса, шестирни, валы, оси, болты.",
  ],
  [
    "Ст40Х",
    "Ст45Х, Ст38ХА, Ст40ХС",
    "Марка 40Х - сталь трудносвариваемая, необходим подогрев, далее термическая обработка.",
    "Изготовление деталей повышенной прочности: оси, валы, вал-шестерни, плунжеры, штоки, коленчатые и кулачковые валы, кольца, шпиндели, оправки, рейки, зубчатые венцы, болты, полуоси, втулки.",
  ],
  [
    "Ст45Х",
    "Ст40Х, Ст50Х",
    "Марка 45Х - сталь трудносвариваемая, необходим подогрев, далее термическая обработка.",
    "Изготовление деталей повышенной твердости, износостойкости, работающие при небольших нагрузках: валы, шестерни, оси, болты, шатуны,.",
  ],
  [
    "Ст50Х",
    "Ст40Х, Ст45Х, Ст50ХН",
    "Марка 50Х - сталь трудносвариваемая, необходим подогрев, далее термическая обработка.",
    "Изготовление деталей повышенной прочности, твердости, износостойкости, работающие при небольших нагрузках: валы, шпиндели, винты, крупные зубчатые колеса, редукторное валы, упорные кольца, валки.",
  ],
  [
    "Ст15Г, Ст20Г",
    "Ст20Г, Ст20, Ст30Г",
    "Марка 15Г, 20Г - сталь хорошо свариваемая.",
    "Изготовление деталей после улучшения: заклепки, поршневые кольца рессор, кулачковые валики, болты, гайки, винты, зубчатые колеса, башмаки, косынки, щтуцера, втулки.",
  ],
  [
    "Ст30Г",
    "Ст35, Ст40Г",
    "Марка 30Г - сталь ограниченно свариваемая, необходим подогрев, далее термическая обработка.",
    "Изготовление деталей высокой прочности: тяги, оси, цилиндры, диски, болты, гайки, винты.",
  ],
  [
    "Ст35Г",
    "-",
    "Марка 35Г - сталь ограниченно свариваемая, необходим подогрев, далее термическая обработка.",
    "Изготовление деталей невысокой прочности: тяги, оси, серьги, траверсы, муфты, валы, звездочки, цилиндры, диски, болты, гайки.",
  ],
  [
    "Ст40Г",
    "Ст45, Ст40Х",
    "Марка 40Г - сталь ограниченно свариваемая, необходим подогрев, далее термическая обработка.",
    "Изготовление деталей повышенной прочности: оси, валы, шестерни, штоки, бандажи, детали арматуры, шатуны, звездочки, валики.",
  ],
  [
    "Ст45Г",
    "Ст40Г, Ст50Г",
    "Марка 45Г - сталь трудносвариваемая, необходим подогрев, далее термическая обработка.",
    "Изготовление деталей машин: коленчатые валы, шатуны, оси, карданные валы, тормозные рычаги, диски трения, зубчатые колеса, анкерные болты.",
  ],
  [
    "Ст50Г",
    "Ст40Г, Ст50",
    "Марка 50Г - сталь трудносвариваемая, необходим подогрев, далее термическая обработка.",
    "Изготовление деталей машин повышенной прочности и износостойкости: диски трения, валы, шестерни, шлицевые валы, шатуны, валики, втулки, кривошипы, шпиндели, обводы маховиков, коленвалы.",
  ],
  [
    "Ст10Г2",
    "Ст09Г2С",
    "Марка 10Г2 - сталь сваривается без ограничений.",
    "Изготовление деталей работающих под давлением при температуре до -70°С.",
  ],
  [
    "Ст35Г2",
    "Ст40Х",
    "Марка 35Г2 - сталь трудносвариваемая, необходим подогрев, далее термическая обработка.",
    "Изготовление деталей высокой износостойкости: валы, полуоси, цапфы, рычаги, сцепления, вилки, фланцы, валы, шатуны, болты, кольца, кожухи, шестерни.",
  ],
  [
    "Ст40Г2",
    "Ст45Г2, Ст60Г",
    "Марка 40Г2 - сталь трудносвариваемая, необходим подогрев, далее термическая обработка.",
    "Изготовление деталей: оси, валы, поршневые штоки, рычаги, валики, полуоси.",
  ],
  [
    "Ст45Г2",
    "Ст50Г2",
    "Марка 45Г2 - сталь трудносвариваемая, необходим подогрев, далее термическая обработка.",
    "Изготовление крупногабаритных, средненагруженных деталей: валы-шестерни, валы, полуоси, червяки, крышки шатунов, шатуны, звенья цепей.",
  ],
  [
    "Ст50Г2",
    "Ст45Г2, Ст60Г",
    "Марка 50Г2 - сталь не применяется для сварных конструкций.",
    "Изготовление деталей работающих на истирание: шестерни, диски трения, валы.",
  ],
  [
    "Ст47ГТ",
    "Ст40ХГРТ",
    "Марка 47ГТ - сталь не применяется для сварных конструкций.",
    "Изготовление полуоси автомобилей.",
  ],
  [
    "Ст18ХГТ",
    "Ст30ХГТ, Ст25ХГТ, Ст25ХГТ, Ст12ХН3А, Ст12Х2Н4А, Ст20ХН2М, Ст20ХГР",
    "Марка 18ХГТ - сталь сваривается без ограничений, ограничения на детали после химико-термической обработки.",
    "Изготовление деталей повышенной прочности и вязкости сердцевины, имеющие высокую поверхностную твердость, работающие под действием ударных нагрузок.",
  ],
  [
    "Ст20ХГР",
    "Ст20ХНА, Ст20ХН24, Ст18Х1Т, Ст12ХН2, Ст12ХН3А",
    "Марка 20ХГР - сталь сваривается без ограничений, ограничения на детали после химико-термической обработки.",
    "Изготовление деталей, которые работают под действием ударных нагрузок: валы, шестерни, червяки, муфты, валики, пальцы, втулки.",
  ],
  [
    "Ст25Х1Т",
    "Ст18ХГТ, Ст30ХГТ, Ст25ХГМ",
    "Марка 25Х1Т - сталь ограниченно свариваемая, необходима термическая обработка.",
    "Изготовления деталей высокой твердости.",
  ],
  [
    "Ст30ХГТ",
    "Ст18ХГТ, Ст20ХН2М, Ст25ХГТ, Ст12Х2Н4А",
    "Марка 30ХГТ - сталь ограниченно свариваемая, необходим подогрев, далее термическая обработка.",
    "Изготовление деталей высокой прочности, вязкой сердцевиной, имеющих высокую поверхностную твердость, работающих при больших скоростях и под действием ударных нагрузок.",
  ],
  [
    "Ст38ХС, Ст40ХС",
    "Ст40ХС, Ст38ХС, Ст35ХГТ",
    "Марка 38ХС, 40ХС - сталь трудносвариваемая.",
    "	Изготовление деталей больших размеров, высокой точности, упругости и износостойкости: валы шестерни, муфты, пальцы.",
  ],
  [
    "Ст15ХФ",
    "	Ст20ХФ",
    "	Марка 15ХФ - сталь сваривается без ограничений.",
    "	Изготовление деталей подвергаемых закалке с низким отпуском: зубчатые колеса, поршневые кольца, валики, плунжеры, копиры.",
  ],
  [
    "Ст40ХФА",
    "	Ст40Х, Ст65Г, Ст50ХФА, Ст30Х3МФ",
    "	Марка 40ХФА - сталь трудносвариваемая, необходим подогрев, далее термическая обработка.",
    "	Узготовление деталей работающих при температуре до 400°С, повышенной износостойкости: валы, штоки, винты, траверсы.",
  ],
  [
    "Ст15ХМ",
    "-",
    "Марка 15ХМ - сталь сваривается без ограничений, рекомендуется подогрев.",
    "Изготовление различных деталей работающих под давлением и температуре от -40°С до 560°С.",
  ],
  [
    "Ст30ХМ, Ст30ХМА",
    "Ст35ХМ, Ст35ХРА",
    "Марка 30ХМ, 30ХМА - сталь ограниченно свариваемая, необходим подогрев, далее термическая обработка.",
    "	Изготовление деталей работающих при температуре до 500°С: шестени, валы, цапфы.",
  ],
  [
    "Ст35ХМ",
    "Ст40Х, Ст40ХН, Ст30ХН, Ст35ХГСА",
    "Марка 35ХМ - сталь ограниченно свариваемая, необходим подогрев, далее термическая обработка.",
    "	Изготовление деталей работающих при температуре до 500°С, в условиях больших нагрузок и скоростей: валы, шестерни, шпиндели, шпильки, фланцы, диски, штоки.",
  ],
  [
    "Ст38ХМ",
    "-",
    "Марка 38ХМ - сталь ограниченно свариваемая.",
    "	Изготовление ответственных деталей для машиностроения.",
  ],
  [
    "Ст20ХН",
    "	Ст15ХГ, Ст20ХНР, Ст18ХГТ",
    "	Марка 20ХН - сталь ограниченно свариваемая.",
    "	Изготовление деталей повышенной вязкости: шестерни, втулки, пальцы, крепежные детали.",
  ],
  [
    "Ст40ХН",
    "	Ст45ХН, Ст50ХН, Ст38ХГН, Ст40Х, Ст35ХГФ, Ст40ХНР, Ст40ХНМ, Ст30ХГВТ",
    "Марка 40ХН - сталь трудносвариваемая, необходим подогрев, далее термическая обработка.",
    "Изготовление деталей для машиностроения повышенной прочности, вязкости, нагруженных ответственных деталей: оси, валы, шатуны, зубчатые колеса, муфты, шпиндели, болты, рычаги, штоки, цилидры.",
  ],
  [
    "Ст45ХН",
    "Ст40ХН",
    "Марка 45ХН - сталь трудносвариваемая, необходим подогрев, далее термическая обработка.",
    "Изготовление ответственных деталей для машиностроения: валы, шатуны, шестерни, шпиндели, муфты, болты.",
  ],
  [
    "Ст50ХН",
    "Ст40ХН, Ст60ХГ",
    "Марка 50ХН - сталь не применяется для сварных конструкций.",
    "Изготовление крупных деталей ответственного характера: валки, валы, зубчатые колеса, бандажи, шатуны, болты, выпускные клапана.",
  ],
  [
    "Ст20ХНР",
    "Ст20ХН",
    "Марка 20ХНР - сталь ограниченно свариваемая, необходим подогрев, далее термическая обработка.",
    "Изготовление крупных деталей работающих при ударных нагрузках: зубчатые колеса, валы, муфты кулачковые, валики, пальцы, втулки.",
  ],
  [
    "Ст12ХН2",
    "Ст20ХНР, Ст20ХГНР, Ст12ХН3А, Ст18ХГТ, Ст20ХГР",
    "Марка 12ХН2 - сталь ограниченно свариваемая, необходим подогрев, далее термическая обработка.",
    "Изготовление деталей высокой прочности, пластичности, вязкости сердцевины, работающие под действием ударных нагрузок и отрицательных температурах: шестерни, валы, червяки, муфты, поршневые пальцы.",
  ],
  [
    "Ст12ХН3А",
    "Ст12ХН2, Ст20ХН3А, Ст25ХГТ, Ст12Х2НА, Ст20ХНР",
    "Марка 12ХН3А - сталь ограниченно свариваемая, необходим подогрев, далее термическая обработка.",
    "Изготовление деталей высокой прочности, пластичности, вязкости сердцевины, высокой поверхностной твердости, работающие под действием ударных нагрузок и отрицательных температурах: шестерни, валы, червяки, муфты, поршневые пальцы.",
  ],
  [
    "Ст20ХН3А",
    "Ст20ХГНР, Ст20ХНГ, Ст38ХА, Ст20ХГР",
    "Марка 20ХН3А - сталь ограниченно свариваемая, необходим подогрев, далее термическая обработка.",
    "Изготовление деталей высокой прочности, пластичности, вязкости сердцевины, высокой поверхностной твердости, работающие под действием ударных нагрузок и отрицательных температурах: шестерни, валы, червяки, муфты, поршневые пальцы.",
  ],
  [
    "Ст12Х2Н4А",
    "Ст20ХГНР, Ст12ХН2, Ст20ХГР, Ст12ХН3А, Ст20Х2Н4А",
    "Марка 12Х2Н4А - сталь ограниченно свариваемая, необходим подогрев, далее термическая обработка.",
    "Изготовление деталей высокой прочности, пластичности, вязкости сердцевины, высокой поверхностной твердости, работающие под действием ударных нагрузок и отрицательных температурах: шестерни, валы, червяки, муфты, поршневые пальцы.",
  ],
  [
    "Ст20Х2Н4А",
    "Ст20ХГНР, Ст20ХГНТР",
    "Марка 20Х2Н4А - сталь ограниченно свариваемая, необходим подогрев, далее термическая обработка.",
    "Изготовление деталей высокой прочности, пластичности, вязкости сердцевины, высокой поверхностной твердости, работающие под действием ударных нагрузок и отрицательных температурах: шестерни, валы, червяки, муфты, поршневые пальцы.",
  ],
  [
    "Ст30ХН3А",
    "Ст30Х2ГН2, Ст34ХН2М",
    "Марка 30ХН3А - сталь ограниченно свариваемая, необходим подогрев, далее термическая обработка.",
    "Изготовление улучшаемых деталей, венцы ведомых колес тяговых зубчатых передач электропоездов, шестерни.",
  ],
  [
    "Ст20ХГСА",
    "Ст30ХГСА",
    "Марка 20ХГСА - сталь сваривается без ограничений.",
    "Изготовление деталей работающих в условиях износа при температуре 200°С: винты ходовые, оси, валы, червяки.",
  ],
  [
    "Ст25ХГСА",
    "Ст20ХГСА",
    "Марка 25ХГСА - сталь сваривается без ограничений.",
    "Изготовление ответственных сварных и штампованных деталей: ходовые винты, оси, валы, червяки, шатуны, валы, штоки.",
  ],
  [
    "Ст30ХГС",
    "Ст40ХФА, Ст35ХМ, Ст40ХН, Ст35ХГСА",
    "Марка 30ХГС - сталь ограниченно свариваемая, необходим подогрев, далее термическая обработка.",
    "Изготовление ответственных сварных конструкций и крепежных деталей: валы, оси, зубчатые колеса, тормозные ленты моторов, фланцы, корпуса, рычаги, толкатели.",
  ],
  [
    "Ст30ХН2МА",
    "Ст40ХФА, Ст35ХМ, Ст40ХН, Ст35ХГСА",
    "Марка 30ХН2МА - сталь ограниченно свариваемая, необходим подогрев, далее термическая обработка.",
    "Изготовление ответственных деталей работающих в сложных условиях и повышенных температурах: валы, шатуны, ответственные болты, шпильки, диски, звездочки.",
  ],
  [
    "Ст38ХН2МА",
    "-",
    "Марка 38ХН2МА - сталь не применяется для сварных конструкций.",
    "Изготовление тяжелонагруженных деталей, особо ответственных деталей: валы, шатуны, болты, шпильки.",
  ],
  [
    "Ст40ХН2МА",
    "Ст40ХГТ, Ст40ХГР, Ст30ХЗМФ, Ст45ХН2МФА",
    "Марка 40ХН2МА - сталь трудносвариваемая, необходим подогрев, далее термическая обработка.",
    "Изготовление тяжелонагруженных деталей: валы, клапаны, шатуны, крышки шатунов, болты, шестерни, мыфты кулачковые, диски, валки для прокатки металлов.",
  ],
  [
    "Ст40Х2Н2МА",
    "Ст38Х2Н2МА",
    "Марка 40Х2Н2МА - сталь трудносвариваемая, необходим подогрев, далее термическая обработка.",
    "Изготовление деталей для машиностроения: валы, диски, редукторные шестерни, крепежные детали.",
  ],
  [
    "Ст38ХН3МА",
    "-",
    "Марка 38ХН3МА - сталь не применяется для сварных конструкций.",
    "Изготовление особо крупных ответственных деталей: валы, оси, шестерни.",
  ],
  [
    "Ст18Х2Н4МА",
    "Ст20Х2Н4А",
    "Марка 18Х2Н4МА - сталь трудносвариваемая, необходим подогрев, далее термическая обработка.",
    "Изготовление деталей высокой прочности, вязкости, износостойкости, подвергающиеся вибрациям и нагрузкам, работающие при температуре от -70°С до 450°С.",
  ],
  [
    "Ст30ХГСА",
    "Ст40ХФА, Ст35ХМ, Ст40ХН, Ст25ХГСА, Ст35ХГСА",
    "Марка 30ХГСА - сталь трудносвариваемая, необходим подогрев, далее термическая обработка.",
    "Изготовление деталей высокой прочности, вязкости, износостойкости, подвергающиеся вибрациям и нагрузкам, работающие при температуре от -70°С до 450°С.",
  ],
  [
    "Ст35ХГСА",
    "Ст30ХГС, Ст30ХГСА, Ст30ХГТ, Ст35ХМ",
    "Марка 35ХГСА - сталь трудносвариваемая, необходим подогрев, далее термическая обработка.",
    "Изготовление деталей сложных конфигураций работающих в условиях нагрузок: фланцы, кулачки, пальцы, валики, рычаги, оси, детали сварных конструкций.",
  ],
  [
    "Ст30ХГСН2А",
    "-",
    "Марка 30ХГСН2А - сталь трудносвариваемая, необходим подогрев, далее термическая обработка.",
    "Изготовление тяжелонагруженных деталей: шестерни, фланцы, кулачки, пальцы, валики, рычаги, оси, шпильки.",
  ],
  [
    "Ст38ХГН",
    "Ст38ХГНМ",
    "Марка 38ХГН - сталь трудносвариваемая, необходим подогрев, далее термическая обработка.",
    "Изготовление деталей повышенной прочности, детали экскаваторов, крепеж, валы, оси, зубчатые колеса, серьги.",
  ],
  [
    "Ст20ХГНР",
    "Ст20ХН3А, Ст12ХН2, Ст12ХН3А",
    "Марка 20ХГНР - сталь трудносвариваемая, необходим подогрев, далее термическая обработка.",
    "Изготовление деталей работающих в условиях ударных нагрузок, ответственные детали: зубчатые колеса, вал-шестерни, червяки, муфты, валики, втулки.",
  ],

  [
    "Ст20ХН2М",
    "Ст20ХГР, Ст15ХР, Ст20ХНР, Ст20ХГНР",
    "Марка 20ХН2М - сталь трудносвариваемая, необходим подогрев, далее термическая обработка.",
    "Изготовление деталей для машиностроения: шестерни, полуоси, сателлиты, кулачки, шарниры.",
  ],

  [
    "Ст30ХН2МФА",
    "Ст30ХН2ВФА",
    "Марка 30ХН2МФА - сталь трудносвариваемая, необходим подогрев, далее термическая обработка.",
    "Изготовление деталей турбин, компрессорных машин, деталей работающих при высоких температурах: валы, роторы, диски, шпильки.",
  ],

  [
    "Ст36Х2Н2МФА",
    "-",
    "Марка 36Х2Н2МФА - сталь трудносвариваемая.",
    "Изготовление крупных и ответственных больших деталей: диски, крепежные болты.",
  ],

  [
    "Ст38ХН3МФА",
    "-",
    "Марка 38ХН3МФА - сталь не применяется для сварных конструкций.",
    "Изготовление наиболее ответственных тяжелонагруженных деталей работающих при температурном режиме до 400°С.",
  ],

  [
    "Ст45ХН2МФА",
    "-",
    "Марка 45ХН2МФА - сталь трудносвариваемая, необходим подогрев, далее термическая обработка.",
    "Изготовление нагруженных деталей, деталей испытывающих динамические нагрузки: торсионные валы, коробки передач.",
  ],

  [
    "Ст20ХН4ФА",
    "Ст18Х2Н4МА",
    "Марка 20ХН4ФА - сталь не применяется для сварных конструкций.",
    "Изготовление деталей для машиностроения: клапаны впуска, болты, шпильки, деталей работающих в коррозионной среде при температуре до 400°С.",
  ],

  [
    "Ст38Х2МЮА",
    "Ст38Х2ЮА, Ст38ХВФЮ, Ст38Х2Ю, Ст20Х3МВФ",
    "Марка 38Х2МЮА - сталь не применяется для сварных конструкций.",
    "Изготовление деталей для машиностроения: штоки клапанов паровых турбин, гильзы цилиндров двигателей внутреннего сгорания, иглы форсунок, тарелки букс, распылители, пальцы, плунжеры, шестерни, валы, втулки.",
  ],
];

export const Gost_14959_79 = [
  [
    "Ст65, Ст70",
    "Ст60, Ст70, Ст65Г",
    "Марка 65, 70 - сталь не применяется для сварных конструкций.",
    "Изготовление деталей повышенной прочности, имеющие упругие свойства и износостойкость, детали работающие в условиях трения и вибрации: рессоры, пружины.",
  ],

  [
    "Ст75",
    "Ст70, Ст80, Ст85",
    "Марка 75 - сталь не применяется для сварных конструкций.",
    "Изготовление деталей работающих в условиях вибрационных и статических нагрузок: пружины круглые и плоские, пружины клапанов двигателя автомобиля, пружины амортизаторов, рессоры, замковые шайбы, диски сцепления, эксцентрики, шпиндели, прокладки.",
  ],

  [
    "Ст85",
    "Ст70, Ст75, Ст80",
    "Марка 85 - сталь не применяется для сварных конструкций.",
    "Изготовление деталей, имеющие высокие прочные и упругие свойства, а также износостойкость: пружины, фрикционные диски.",
  ],

  [
    "Ст60Г",
    "Ст65Г",
    "Марка 60Г - сталь не применяется для сварных конструкций.",
    "Изготовление деталей тяжелого машиностроения: пружины, рессоры, пружинные кольца, бандажи, тормозные барабаны, ленты, скобы, втулки.",
  ],

  [
    "Ст65Г",
    "Ст70, Ст78А, Ст70Г, Ст60С2А, Ст9ХС, Ст50ХФА, Ст60С2, Ст55С2",
    "Марка 65Г - сталь не применяется для сварных конструкций.",
    "Изготовление деталей для машиностроения: пружины, рессоры, упорные шайбы, тормозные ленты, фрикционные диски, шестерни, фланцы, корпуса подшипников, детали повышенной износостойкости работающие без ударных нагрузок.",
  ],

  [
    "Ст55С2",
    "Ст50С2, Ст60С2, Ст35Х2АФ",
    "Марка 55С2 - сталь не применяется для сварных конструкций.",
    "Изготовление деталей для машиностроения, тракторостроения, железнодорожного транспорта: пружины, рессоры.",
  ],

  [
    "Ст60С2, Ст60С2А",
    "Ст55С2, Ст50ХФА, Ст60С2Н2А, Ст60С2Г, Ст50ХФА",
    "Марка 60С2, 60С2А - сталь не применяется для сварных конструкций.",
    "Изготовление деталей для машиностроения: пружины тяжелонагруженные, торсионные валы, кольца, цанги, фрикционные диски, шайбы, шайбы Гровера.",
  ],

  [
    "Ст70С3А",
    "-",
    "Марка 70С3А - сталь не применяется для сварных конструкций.",
    "Изготовление тяжелонагруженных пружин ответственного назначения.",
  ],

  [
    "Ст55ХГР",
    "-",
    "Марка 55ХГР - сталь не применяется для сварных конструкций.",
    "Изготовление рессорной полосовой стали толщиной от 3 мм до 24 мм.",
  ],

  [
    "Ст50ХФА",
    "Ст60С2А, Ст50ХГФА, Ст9ХС",
    "Марка 50ХФА - сталь не применяется для сварных конструкций.",
    "Изготовление тяжелонагруженных и ответственных деталей, деталей высокой усталостной прочности, деталей работающих при температуре до 300°С.",
  ],

  [
    "Ст60С2ХА",
    "Ст60С2ХФА, Ст60С2Н2А",
    "Марка 60С2ХА - сталь не применяется для сварных конструкций.",
    "Изготовление крупных высоконагруженных деталей ответственного назначения: пружины, рессоры.",
  ],

  [
    "Ст60С2ХФА",
    "Ст60С2А, Ст60С2ХА, Ст9ХС, Ст60С2ВА",
    "Марка 60С2ХФА - сталь не применяется для сварных конструкций.",
    "Изготовление высоконагруженных деталей из круглой калиброванной стали: пружины, рессоры.",
  ],
  [
    "Ст65С2ВА",
    "Ст60С2А, Ст60С2ХА",
    "Марка 65С2ВА - сталь не применяется для сварных конструкций.",
    "Изготовление ответственных и высоконагруженных деталей для машиностроения: рессоры, пружины.",
  ],

  [
    "Ст60С2Н2А",
    "Ст60С2А, Ст60С2ХА",
    "Марка 60С2Н2А - сталь не применяется для сварных конструкций.",
    "Изготовление высоконагруженных и ответственных деталей для машиностроения: рессоры, пружины.",
  ],
];

export const Gost_1435_90 = [
  [
    "У7, У7А",
    "У8",
    "Марка У7, У7А - сталь не применяется для сварных конструкций.",
    "Изготовление инструмента, который не вызывает разогрева рабочей кромки: зубила, долота, бородки, молотки, лезвия ножниц, топоры, колуны, стамески, плоскогубцы, кувалды.",
  ],

  [
    "У8, У8А",
    "У7, У7А, У10, У10А",
    "Марка У8, У8А - сталь не применяется для сварных конструкций.",
    "Изготовление инструмента, который работает в условиях невызывающих разогрева режущей кромки: фрезы, земховки, топоры, стамески, долота, пилы, кермеры, отвертки, плоскогубцы, кусачки.",
  ],

  [
    "У9, У9А",
    "У7, У7А, У8, У8А",
    "Марка У9, У9А - сталь не применяется для сварных конструкций.",
    "Изготовление инструмента, который работает в условиях невызывающих разогрева режущей кромки, инструмент для обработки дерева, слесарно-монтажный инструмент.",
  ],

  [
    "У10, У10А",
    "У12, У12А",
    "Марка У10, У10А - сталь не применяется для сварных конструкций.",
    "Изготовление инструмента, который работает в условиях невызывающих разогрева режущей кромки: пилы для обработки древесины, матрицы для холодной штамповки, гладкие калибры, топоры.",
  ],

  [
    "У12, У12А",
    "У10, У10А",
    "Марка У12, У12А - сталь не применяется для сварных конструкций.",
    "Изготовление инструмента, который работает в условиях невызывающих разогрева режущей кромки: надфили, плашки, развертки, гладкие калибры, скобы.",
  ],
];

export const Gost_5950_73 = [
  [
    "ХВ4Ф",
    "-",
    "Марка ХВ4Ф - сталь не применяется для сварных конструкций.",
    "Изготовление инструмента: резцы, фрезы, детали работающие при напряженной среде.",
  ],

  [
    "9Х1",
    "9Х2",
    "Марка 9Х1 - сталь не применяется для сварных конструкций.",
    "Изготовление инструмента деревообрабатывающего, рабочие и опорные валки для холодной прокатки металлов, валки для сортовых станов горячей прокатки металлов, холодновысадочные штампы.",
  ],

  [
    "9ХС",
    "ХВГ",
    "Марка 9ХС - сталь не применяется для сварных конструкций.",
    "Изготовление инструмента: сверла, разверстки, метчики, плашки, гребешки, фрезы, клейма для холодных работ.",
  ],

  [
    "ХВГ",
    "9ХС, 9ХВГ, ШХ15СГ",
    "Марка ХВГ - сталь не применяется для сварных конструкций.",
    "Изготовление инструмента измерительного и режущего: резьбовые калибры, протяжки, метчики, плашки, холодновысадочные матрицы, технологическая оснастка.",
  ],

  [
    "9ХВГ",
    "ХВГ",
    "Марка 9ХВГ - сталь не применяется для сварных конструкций.",
    "Изготовление инструмента, резьбовые калибры, лекала сложной формы, точные штампы для холодных работ.",
  ],

  [
    "Х6ВФ",
    "Х12Ф1, Х12М, 9Х5Ф",
    "Марка Х6ВФ - сталь не применяется для сварных конструкций.",
    "Изготовление инструмента: резьбонакатный инструмент, ролики, плашки, ручные ножовочные полотна, матрицы, пуансоны, зубонакатники, инструменты для холодной деформации, дереворежущий инструмент.",
  ],

  [
    "Х12, Х12ВМФ",
    "Х12МФ",
    "Марка Х12, Х12ВМФ - сталь не применяется для сварных конструкций.",
    "Изготовление штампов высокой устойчивости против истирания, гибочные и формовочные штампы, матрицы и пуансоны.",
  ],

  [
    "Х12МФ, Х12Ф1",
    "Х6ВФ, Х12Ф1, Х12ВМФ, Х6ВФ, Х6В3ФМ",
    "Марка Х12МФ, Х12Ф1 - сталь не применяется для сварных конструкций.",
    "Изготовление профилировочных роликов сложных форм, эталонные шестерни, накатные плашки, волоки, матрицы, штамповки активной части электических машин.",
  ],

  [
    "7ХГ2ВМФ",
    "-",
    "Марка 7ХГ2ВМФ - сталь не применяется для сварных конструкций.",
    "Изготовление вырубного инструмента сложной конфигурации, изготовление штампов объемного холодного деформирования.",
  ],

  [
    "7Х3, 8Х3",
    "8Х2, 7Х3",
    "Марка 7Х3, 8Х3 - сталь не применяется для сварных конструкций.",
    "Изготовление инструмента горячей высадки крепежа заготовок, деталей штампов для горячего прессования, гибочные, обрезные и просечные штампы.",
  ],

  [
    "5ХНМ",
    "5ХНВ, 5ХГМ, 4ХМФС, 5ХНВС, 4Х5В2ФС",
    "Марка 5ХНМ - сталь не применяется для сварных конструкций.",
    "Изготовление штампов паровоздушных пневматических молотов, прессованых и штампов машинной скоростной штамповки, изготовление блоков матриц.",
  ],

  [
    "5ХГМ",
    "5ХНМ, 5ХНВ, 6ХВС, 5ХНС, 5ХНСВ",
    "Марка 5ХГМ - сталь не применяется для сварных конструкций.",
    "Изготовление молотовых штампов паровоздушных и пневматических молотов.",
  ],

  [
    "4ХМФС",
    "-",
    "Марка 4ХМФС - сталь не применяется для сварных конструкций.",
    "Изготовление прессового инструмента для обработки алюминиевых сплавов.",
  ],
  [
    "4Х5МФС",
    "-",
    "Марка 4Х5МФС - сталь не применяется для сварных конструкций.",
    "Изготовление мелких молотовых штампов.",
  ],

  [
    "4Х5МФ1С",
    "-",
    "Марка 4Х5МФ1С - сталь не применяется для сварных конструкций.",
    "Изготовление инструмента для высадки заготовок из конструкционных и жаропрочных сталей на горизонтально-ковочных машинах, пресс-формы для литья под давлением цинковых, алюминиевых и магниевых сплавов.",
  ],

  [
    "3Х3М3Ф",
    "-",
    "Марка 3Х3М3Ф - сталь не применяется для сварных конструкций.",
    "Изготовление инструмента для горячего деформирования на кривошипных прессах и горизонтально-ковочных машинах, изготовление пресс-форм для литья под давлением медных сплавов.",
  ],

  [
    "6ХС",
    "-",
    "Марка 6ХС - сталь не применяется для сварных конструкций.",
    "Изготовление пневматических зубил и штампов для холодной штамповки, изготовление рубильных ножей.",
  ],

  [
    "4ХВ2С",
    "4Х5В2ФС, 4Х3В2М2",
    "Марка 4ХВ2С - сталь не применяется для сварных конструкций.",
    "Изготовление пневматического инструмента: зубила, обжимки.",
  ],

  [
    "5ХВ2СФ, 6ХВ2С",
    "6ХВ2С, 6Х3ФС",
    "Марка 5ХВ2СФ, 6ХВ2С - сталь не применяется для сварных конструкций.",
    "Изготовление деревообделочного инструмента для длительной работы, ножи для холодной резки металла, резьбонакатные плашки, пуансоны, обжимные матрицы.",
  ],

  [
    "6ХВГ",
    "-",
    "Марка 6ХВГ - сталь не применяется для сварных конструкций.",
    "Изготовление штампов для горячей штамповки, пуансонов сложной формы.",
  ],
];

export const Gost_19265_73 = [
  [
    "Р18",
    "-",
    "Марка Р18 - сталь сваривается при стыковой электросварке со сталью 45 и 40Х.",
    "Изготовление инструмента, резцы, сверла, фрезы, резьбовые фрезы, долбяки, развертки, зенкеры, метчики, протяжки для обработки конструкционных сталей.",
  ],

  [
    "Р6М5К5",
    "-",
    "Марка Р6М5К5 - сталь сваривается при стыковой электросварке со сталью 45 и 40Х.",
    "Изготовление инструмента, для черновых и получистовых инструментов при обработке нержавеющих и жаропрочных сталей.",
  ],

  [
    "Р9М4Н8",
    "-",
    "Марка Р9М4Н8 - сталь сваривается при стыковой электросварке со сталью 45 и 40Х.",
    "Изготовление зуборезного инструмента: фрезы, фасонные резцы, зенкеры, метчики для обработки высокопрочных, жаропрочных и нержавеющих сталей.",
  ],
];

export const Gost_801_78 = [
  [
    "ШХ15",
    "ШХ9, ШХ12, ШХ15СГ",
    "Марка ШХ15 - сталь сваривается, способ сварки КТС (Контактно-точечная сварка).",
    "Изготовление деталей с высокой твердостью, износостойкостью, контактной прочностью: изготовление шариков до 150 мм, роликов диаметром до 23 мм, кольца подшипников с толщиной стенки до 14 мм, втулки плунжеров, плунжеры, нагнетательные клапана, корпуса распылителей, ролики толкателей.",
  ],

  [
    "ШХ15СГ",
    "ХВГ, ШХ15, 9ХС, ХВСГ",
    "Марка ШХ15СГ - сталь сваривается, способ сварки КТС (Контактно-точечная сварка).",
    "Изготовление роликоподшипников со стенкой толщиной более 30 мм, шарики диаметром более 50 мм, ролики диаметром более 35 мм, изготовление крупногабаритных колец шарико и роликоподшипников.",
  ],

  [
    "ШХ4",
    "-",
    "Марка ШХ4 - сталь сваривается, способ сварки КТС (Контактно-точечная сварка).",
    "Изготовление колец железнодорожных подшипников.",
  ],
];

export const Gost_20072_74 = [
  [
    "12МХ",
    "-",
    "Марка 12МХ - сталь сваривается без ограничений, рекомендуется подогрев, далее термообработка.",
    "Изготовление деталей работающих при температуре до 530°С: трубы пароперегреватели, трубопроводов и колекторных установок высокого давления, поковки для паровых котлов, детали цилиндров газовых турбин.",
  ],

  [
    "12Х1МФ",
    "-",
    "Марка 12Х1МФ - сталь ограниченно свариваемая.",
    "Изготовление деталей работающих при температуре до 580°С.",
  ],

  [
    "25Х1МФ",
    "-",
    "Марка 25Х1МФ - сталь трудносвариваемая.",
    "Изготовление крепежных деталей: болты, плоские пружины, шпильки, детали работающие при температуре от -40°С до 500°С.",
  ],

  [
    "20ХЭМВФ",
    "-",
    "Марка 20ХЭМВФ - сталь ограниченно свариваемая, рекомендуется подогрев, далее термообработка.",
    "Изготовление крепежных деталей работающих при температуре до 560°С: роторы, диски, поковки, болты.",
  ],

  [
    "15Х5М",
    "-",
    "Марка 15Х5М - сталь ограниченно свариваемая, рекомендуется подогрев, далее термообработка.",
    "Изготовление деталей с сопротивляемостью окислению при температуре до 650°С: трубы, задвижки, крепежные детали.",
  ],
];

export const Gost_5632_72 = [
  [
    "40Х9С2",
    "-",
    "Марка 40Х9С2 - сталь не применяется для сварных конструкций.",
    "Изготовление крепежных деталей, выпускных клапанов двигателей.",
  ],
  [
    "40Х10С2М",
    "-",
    "Марка 40Х10С2М - сталь трудносвариваемая.",
    "Изготовление крепежных деталей, клапанов двигателей.",
  ],
  [
    "08Х13, 12Х13, 20Х13",
    "12Х13, 12Х18Н9Т, 20Х13, 12Х13, 14Х17Н2, AISI 420",
    "Марка 08Х13, 12Х13, 20Х13 - сталь ограниченно свариваемая.",
    "Изготовление деталей повышенной пластичности, которые подвергаютя ударным нагрузкам.",
  ],
  [
    "30Х13, 40Х13",
    "40Х13, 30Х13",
    "Марка 30Х13, 40Х13 - сталь не применяется для сварных конструкций.",
    "Изготовление режущего инструмента, предметов домашнего обихода.",
  ],
  [
    "10Х14АГ16",
    "12Х18Н9, 08Х18Н10, 12Х18Н9Т, 12Н18Н10Т",
    "Марка 10Х14АГ16 - сталь сваривается без ограничений.",
    "Изготовление немагнитных деталей, которые работают в слабоагрессивных средах.",
  ],
  [
    "12Х17",
    "12Х18Н9Т, AISI 430",
    "Марка 12Х17 - сталь трудносвариваемая.",
    "Изготовление крепежных деталей, которые работают в кислых растворах.",
  ],
  [
    "08Х17Т, 08Х18Т1",
    "12Х17, 08Х18Т1, 12Х17, 08Х17Т",
    "Марка 08Х17Т, 08Х18Т1 - сталь ограниченно свариваемая.",
    "Изготовление конструкций, работающие в кислых средах, подвергающиеся ударным нагрузкам.",
  ],
  [
    "95Х18",
    "-",
    "Марка 95Х18 - сталь не применяется для сварных конструкций.",
    "Изготовление деталей с высокой твердостью и износостойкостью.",
  ],
  [
    "15Х25Т",
    "12Х18Н10Т",
    "Марка 15Х25Т - сталь трудносвариваемая.",
    "Изготовление сварных металлоконструкций, которые работают без ударных нагрузок.",
  ],
  [
    "15Х28",
    "15Х25Т, 20Х23Н18",
    "Марка 15Х28 - сталь трудносвариваемая.",
    "Изготовление сварных металлоконструкций, которые подвергаются ударным нагрузкам.",
  ],
  [
    "20Х23Н13, 20Х23Н18",
    "AISI 310S",
    "Марка 20Х23Н13, 20Х23Н18 - сталь трудносвариваемая.",
    "Изготовление деталей, труб, которые работают при высоких температурах.",
  ],
  [
    "20Н23Н18",
    "10Х25Т, 20Х23Н13",
    "Марка 20Н23Н18 - сталь ограниченно свариваемая.",
    "Изготовление деталей работающих при температуре до 1100°С.",
  ],
  [
    "10Х23Н18",
    "-",
    "Марка 10Х23Н18 - сталь ограниченно свариваемая.",
    "Изготовление листовых деталей, которые работают при температуре до 1100°С.",
  ],
  [
    "20Х25Н20С2",
    "-",
    "Марка 20Х25Н20С2 - сталь ограниченно свариваемая.",
    "Изготовление печных деталей, работающие при температуре до 1100°С.",
  ],
  [
    "15Х12ВНМФ",
    "-",
    "Марка 15Х12ВНМФ - сталь трудносвариваемая.",
    "Изготовление деталей, которые работают до 780°С.",
  ],
  [
    "20Х12ВНМФ",
    "15Х12ВНМФ, 18Х11МНФБ",
    "Марка 20Х12ВНМФ - сталь трудносвариваемая.",
    "Изготовление высоконагруженных деталей.",
  ],
  [
    "Х12Н8Г8МФБ",
    "-",
    "Марка Х12Н8Г8МФБ - сталь ограниченно свариваемая.",
    "Изготовление крепежных деталей с ограниченным сроком службы.",
  ],
  [
    "13Х11Н2В2МФ",
    "-",
    "Марка 13Х11Н2В2МФ - сталь ограниченно свариваемая.",
    "Изготовление ответственных нагруженных деталей.",
  ],
  [
    "45Х14Н14В2М",
    "-",
    "Марка 45Х14Н14В2М - сталь трудносвариваемая.",
    "Изготовление деталей арматуры и трубопроводов.",
  ],
  [
    "40Х15Н7Г7Ф2МС",
    "-",
    "Марка 40Х15Н7Г7Ф2МС - сталь трудносвариваемая.",
    "Изготовление крепежных деталей, которые работают при температуре до 650°С.",
  ],
  [
    "08Х17Н13М21",
    "10Х17Н13М21",
    "Марка 08Х17Н13М21 - сталь трудносвариваемая.",
    "Изготовление сварных металлоконструкций.",
  ],
  [
    "10Х17Н3М2Т",
    "-",
    "Марка 10Х17Н3М2Т - сталь трудносвариваемая.",
    "Изготовление крепежных деталей.",
  ],
  [
    "03Х17Н14М2",
    "AISI 316",
    "Марка 03Х17Н14М2 - сталь ограниченно свариваемая.",
    "Изготовление химического оборудования, инструмента, который работает в агрессивной среде.",
  ],
  [
    "03Х17Н14М3",
    "AISI 316S, AISI 316L",
    "Марка 03Х17Н14М3 - сталь ограниченно свариваемая.",
    "Изготовление сварных конструкций, изготовление оборудования для пищевой промышленности, химического оборудования, инструмента, который работает в агрессивной среде.",
  ],
  [
    "08Х17Н13М2Т",
    "AISI 316Ti",
    "Марка 08Х17Н13М2Т - сталь ограниченно свариваемая.",
    "Изготовление деталей, которые обладают повышенной устойчивостью к воздействию высоких температур, к среде с присутствием новых ионов хлора, изготовление деталей для пищевой и химической промышленности.",
  ],
  [
    "31Х19Н9МВБТ",
    "-",
    "Марка 31Х19Н9МВБТ - сталь трудносвариваемая.",
    "Изготовление сварных металлоконструкций.",
  ],
  [
    "10Х14Г14Н4Т",
    "20Х13Н4Г9, 12Х18Н9Т, 12Х18Н10Т, 08Х18Н10Т",
    "Марка 10Х14Г14Н4Т - сталь трудносвариваемая.",
    "Изготовление крепежных деталей, которые работают при температуре до 253°С.",
  ],
  [
    "14Х17Н2",
    "20Х17Н2",
    "Марка 14Х17Н2 - сталь трудносвариваемая.",
    "Изготовление деталей компрессорных машин.",
  ],
  [
    "12Х18Н9, 17Х18Н9",
    "20Х13Н4Г9, 10Х14Г14Н4Т, 20Х13Н4Г9, AISI 304",
    "Марка 12Х18Н9, 17Х18Н9 - сталь сваривается без ограничений.",
    "Изготовление холоднокатаного листа и ленты повышенной прочности.",
  ],
  [
    "08Х18Н10, 08Х18Н11, 08Х18Н10Т, 12Х18Н9Т, 12Х18Н10Т",
    "12Х18Н10Т, 15Х25Т, 08Х18Г8Н2Т, 10Х14Г14Н4Т, 08Х17Т, AISI 304H, AISI 304L, AISI 321",
    "Марка 08Х18Н10, 08Х18Н10Т, 12Х18Н9Т, 12Х18Н10Т - сталь сваривается без ограничений.",
    "Изготовление трубного проката, деталей печной арматуры.",
  ],
  [
    "12Х18Н12Т",
    "12Х18Н9, 12Х18Н9Т, 12Х18Н10Т",
    "Марка 12Х18Н12Т - сталь ограниченно свариваемая.",
    "Изготовление трубного проката, деталей выхлопных систем для машиностроения.",
  ],
  [
    "08Х18Г8Н2Т",
    "12Х18Н9Т",
    "Марка 08Х18Г8Н2Т - сталь сваривается без ограничений.",
    "Изготовление сварной аппаратуры.",
  ],
  [
    "20Х20Н14С2",
    "-",
    "Марка 20Х20Н14С2 - сталь сваривается без ограничений.",
    "Изготовление деталей термических печей.",
  ],
  [
    "Х25Н16Г7АР",
    "-",
    "Марка Х25Н16Г7АР - сталь сваривается без ограничений.",
    "Изготовление листового проката, проволоки, трубного проката.",
  ],
  [
    "08Х22Н6Т",
    "12Х18Н9Т, 12Х18Н10Т, 08Х18Н10Т",
    "Марка 08Х22Н6Т - сталь сваривается без ограничений.",
    "Изготовление деталей, сварных аппаратов, которые работают под давлением и в агрессивной среде.",
  ],
  [
    "06ХН28МДТ",
    "03ХН28МДТ",
    "Марка 06ХН28МДТ - сталь сваривается без ограничений.",
    "Изготовление сварных металлоконструкций, которые работают в кислой среде.",
  ],
  [
    "ХН35ВТ",
    "-",
    "Марка ХН35ВТ - сталь трудносвариваемая.",
    "Изготовление пружин, крепежных деталей.",
  ],
  [
    "ХН35ВТЮ",
    "-",
    "Марка ХН35ВТЮ - сталь трудносвариваемая.",
    "Изготовление деталей компрессорных машин.",
  ],
  [
    "ХН70Ю",
    "-",
    "Марка ХН70Ю - сталь ограниченно свариваемая.",
    "Изготовление различных деталей, которые работают при невысоких температурах.",
  ],
  [
    "ХН70ВМЮТ",
    "-",
    "Марка ХН70ВМЮТ - сталь трудносвариваемая.",
    "Изготовление крепежных деталей.",
  ],
  [
    "ХН70ВМЮФ",
    "-",
    "Марка ХН70ВМЮФ - сталь трудносвариваемая.",
    "Изготовление тяжелонагруженных деталей.",
  ],
  [
    "ХН77ТЮР",
    "-",
    "Марка ХН77ТЮР - сталь трудно свариваемая.",
    "Изготовление тяжелонагруженных деталей.",
  ],
  [
    "ХН78Т",
    "ХН38Т, 12Х25Н16Г7АР, 20Х23Н18, AISI 310S",
    "Марка ХН78Т - сталь трудносвариваемая.",
    "Изготовление сортовых деталей, трубного проката, который работает при температуре до 1100°С.",
  ],
  [
    "ХН80ТБО",
    "-",
    "Марка ХН80ТБО - сталь трудносвариваемая.",
    "Изготовление крепежных деталей.",
  ],
];

export const Gost_977_88 = [
  [
    "15Л",
    "-",
    "-",
    "Изготовление деталей, которые работают под действием средних статических и динамических нагрузок: копровые бабы, блоки, ролики, корпусы, поводки, захваты, пильные рамы, а также деталей сварно-литых конструкций с большим объемом сварки.",
  ],
  [
    "20Л",
    "-",
    "-",
    "Изготовление деталей сварно-литых конструкций, которые работают при температуре от -40°С до 450°С: арматура, фасонные отливки общего машиностроения, шаботы.",
  ],
  [
    "25Л",
    "-",
    "-",
    "Изготовление деталей сварно-литых конструкций, которые работают при температуре от -40°С до 450°С под давлением: плиты настильные, рамы рольгангов и тележек, корпуса подшипников, станины прокатных станов, шкивы, траверсы, поршни буксы, крышки цилиндров.",
  ],
  [
    "30Л",
    "-",
    "-",
    "Изготовление деталей, которые работают под действием средних статических и динамических нагрузок: станины, балки, опорные кольца, бандажи, маховики, рычаги, балансиры, корпусы редуктора, муфты, шкивы, кронштейны.",
  ],
  [
    "35Л",
    "-",
    "-",
    "Изготовление деталей, которые работают под действием средних статических и динамических нагрузок: балансиры, диафрагмы, катки, валки, кронштейны, станины прокатных станов, зубчатые колеса, тяги, бегунки, задвижки.",
  ],
  [
    "40Л",
    "-",
    "-",
    "Изготовление деталей, которые работают при температуре до 400°С: вилки, звездочки, кожухи, шестерни, тормозные диски, муфты, корпусы, станины.",
  ],
  [
    "45ГЛ",
    "-",
    "-",
    "Изготовление деталей повышенной прочности и высокого сопротивления износу, которые работают под действием статических и динамических нагрузок: кожухи, опорные катки, звездочки, станины, зубчатые колеса и венцы, тормозные диски, муфты.",
  ],
  [
    "50Л",
    "-",
    "-",
    "Изготовление деталей для машиностроения: шестерни, бегунки, колеса, зубчатые колеса подъемно-транспортных машин, валки станов для прокатки мягкого металла.",
  ],
];
